app/controllers/api/v1/users_controller.rb

    def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "first_name", "last_name", "bio", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"